export const subjectsList = [
  'পদার্থবিজ্ঞান',
  'রসায়ন',
  'সাধারণ গণিত',
  'উচ্চতর গণিত',
  'জীববিজ্ঞান',
  'তথ্য ও যোগাযোগ প্রযুক্তি'
];

export const chaptersBySubject: Record<string, string[]> = {
  'পদার্থবিজ্ঞান': [
    'ভৌত রাশি ও পরিমাপ',
    'গতি',
    'বল',
    'কাজ, ক্ষমতা ও শক্তি',
    'পদার্থের অবস্থা ও চাপ',
    'বস্তুর উপর তাপের প্রভাব',
    'তরঙ্গ ও শব্দ',
    'আলোর প্রতিফলন',
    'আলোর প্রতিসরণ',
    'স্থির তড়িৎ',
    'চল তড়িৎ',
    'বিদ্যুতের চৌম্বক ক্রিয়া'
  ],
  'রসায়ন': [
    'পদার্থের অবস্থা',
    'পদার্থের গঠন',
    'পর্যায় সারণি',
    'রাসায়নিক বন্ধন',
    'মোলের ধারণা ও রাসায়নিক গণনা',
    'রাসায়নিক বিক্রিয়া',
    'রাসায়নিক পরিবর্তন ও তাপ',
    'অ্যাসিড-ক্ষারক সমতা',
    'খনিজ সম্পদ ও ধাতু-অধাতু',
    'জীবাশ্ম ও হাইড্রোকার্বন'
  ],
  'সাধারণ গণিত': [
    'বাস্তব সংখ্যা',
    'সেট ও ফাংশন',
    'বীজগাণিতিক রাশি',
    'সূচক ও লগারিদম',
    'এক চলকবিশিষ্ট সমীকরণ',
    'ব্যবহারিক জ্যামিতি ও বৃত্ত',
    'ত্রিকোণমিতিক অনুপাত',
    'দূরত্ব ও উচ্চতা',
    'সসীম ধারা',
    'পরিমিতি',
    'পরিসংখ্যান'
  ],
  'গণিত': [
    'বাস্তব সংখ্যা',
    'সেট ও ফাংশন',
    'বীজগাণিতিক রাশি',
    'সূচক ও লগারিদম',
    'এক চলকবিশিষ্ট সমীকরণ',
    'ব্যবহারিক জ্যামিতি ও বৃত্ত',
    'ত্রিকোণমিতিক অনুপাত',
    'দূরত্ব ও উচ্চতা',
    'সসীম ধারা',
    'পরিমিতি',
    'পরিসংখ্যান'
  ],
  'উচ্চতর গণিত': [
    'সেট ও ফাংশন',
    'বীজগাণিতিক রাশি',
    'জ্যামিতি',
    'জ্যামিতি (অ্যাপোলোনিয়াস ও টলেমি)',
    'ত্রিকোণমিতি',
    'দ্বিপদী বিস্তৃতি',
    'স্থানাঙ্ক জ্যামিতি',
    'অসীম ধারা',
    'সমতলে ভেক্টর',
    'সম্ভাবনা'
  ],
  'জীববিজ্ঞান': [
    'জীবন পাঠ',
    'জীবন পাঠ ও শ্রেণিবিন্যাস',
    'জীবকোষ ও টিস্যু',
    'কোষ ও কোষীয় অঙ্গাণু',
    'কোষ বিভাজন',
    'জীবনীশক্তি',
    'জীবনীশক্তি (সালোকসংশ্লেষণ)',
    'উদ্ভিদ ও প্রাণীর পুষ্টি',
    'খাদ্য, পুষ্টি এবং পরিপাক',
    'জীবে পরিবহন',
    'রক্ত ও রক্ত সংবহন',
    'গ্যাসীয় বিনিময়',
    'রেচন প্রক্রিয়া',
    'দৃঢ়তা প্রদান ও চলন',
    'সমন্বয় ও নিঃসরণ',
    'সমন্বয় ও হরমোন',
    'জীবের বংশগতি ও বিবর্তন',
    'বংশগতি ও জিনতত্ত্ব',
    'পরিবেশ ও বাস্তুতন্ত্র'
  ],
  'তথ্য ও যোগাযোগ প্রযুক্তি': [
    'তথ্য ও যোগাযোগ প্রযুক্তি এবং আমাদের বাংলাদেশ',
    'কম্পিউটার ও কম্পিউটার ব্যবহারকারীর নিরাপত্তা',
    'আমার শিক্ষায় ইন্টারনেট',
    'আমার লেখালেখি ও হিসাব',
    'মাল্টিমিডিয়া ও গ্রাফিক্স',
    'ই-লার্নিং ও ডিজিটাল কনটেন্ট'
  ]
};
